Revit 2024 API
ExportUtils.GetNurbsSurfaceDataForSurface Method
 Returns the necessary information to define a NURBS surface for a given [!:Autodesk::Revit::DB::HermiteSuface] or [!:Autodesk::Revit::DB::RuledSuface].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static NurbsSurfaceData GetNurbsSurfaceDataForSurface(
	Surface surface
)
Visual Basic
Public Shared Function GetNurbsSurfaceDataForSurface ( _
	surface As Surface _
) As NurbsSurfaceData
Visual C++
public:
static NurbsSurfaceData^ GetNurbsSurfaceDataForSurface(
	Surface^ surface
)
Parameters
surface
Type: Autodesk.Revit.DB.Surface
 The HermiteSurface or RuledSurface to be converted.
Return Value
 A class containing the necessary data to define a NURBS surface.
Remarks
 This function is intended for export purposes.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  This surface type is not supported for this function.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  Couldn't get NURBS data from surface.
See Also
ExportUtils Class
Autodesk.Revit.DB Namespace